def number_to_words(n):
    ed=["","один","два","три","четыре","пять","шесть","семь","восемь","девять"]
    dec = ["", "", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
    spec=["десять","одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать"]
    if n<10:
        return ed[n]
    elif n<20:
        return spec[n-10]
    else:
        dec_1=dec[n//10]
        ed_1=ed[n%10]
        return str(dec_1)+" "+str(ed_1)
print(number_to_words(65))